Minor md changes
